export const TIME_REGEX = '^([0-1]?[0-9]|[2][0-3]):([0-5][0-9])(:[0-5][0-9])?$';

/**
 *
 * ^(0[1-9]|[12][0-9]|3[01])\.(0[1-9]|1[012])\.(19[7-9][0-9]|20[0-6][0-9]|2070)$
 *
 * Цей регулярний вираз перевіряє, чи введений рядок у форматі dd.mm.yyyy,
 * де рік знаходиться в діапазоні від 1970 до 2070, і де “.” є єдиним допустимим роздільником.
 * Формати, такі як dd/mm/yyyy або dd-mm-yyyy, не будуть прийняті цим регулярним виразом.
 * Знову ж таки, цей регулярний вираз не перевіряє, чи дата дійсна
 * (наприклад, 30 лютого буде прийнято).
 *
 */
export const DATE_REGEX =
  '^(0[1-9]|[12][0-9]|3[01]).(0[1-9]|1[012]).(19[7-9][0-9]|20[0-6][0-9]|2070)$';

export const FIFTEEN_MINUTES = 15 * 60 * 1000;
export const ONE_DAY = 24 * 60 * 60 * 1000;
